<template>
    <div class="exgame-page-footer clearbox">
        <div class="footer-pic clearbox">
            <div class="fl" style="height: 60px;line-height: 50px;font-size: 24px;margin-right: 20px;">臻Game</div>
            <div class="game-pi fl">
                <svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" fill="currentColor" class="bi bi-controller" viewBox="0 0 16 16">
                    <path d="M11.5 6.027a.5.5 0 1 1-1 0 .5.5 0 0 1 1 0zm-1.5 1.5a.5.5 0 1 0 0-1 .5.5 0 0 0 0 1zm2.5-.5a.5.5 0 1 1-1 0 .5.5 0 0 1 1 0zm-1.5 1.5a.5.5 0 1 0 0-1 .5.5 0 0 0 0 1zm-6.5-3h1v1h1v1h-1v1h-1v-1h-1v-1h1v-1z"/>
                    <path d="M3.051 3.26a.5.5 0 0 1 .354-.613l1.932-.518a.5.5 0 0 1 .62.39c.655-.079 1.35-.117 2.043-.117.72 0 1.443.041 2.12.126a.5.5 0 0 1 .622-.399l1.932.518a.5.5 0 0 1 .306.729c.14.09.266.19.373.297.408.408.78 1.05 1.095 1.772.32.733.599 1.591.805 2.466.206.875.34 1.78.364 2.606.024.816-.059 1.602-.328 2.21a1.42 1.42 0 0 1-1.445.83c-.636-.067-1.115-.394-1.513-.773-.245-.232-.496-.526-.739-.808-.126-.148-.25-.292-.368-.423-.728-.804-1.597-1.527-3.224-1.527-1.627 0-2.496.723-3.224 1.527-.119.131-.242.275-.368.423-.243.282-.494.575-.739.808-.398.38-.877.706-1.513.773a1.42 1.42 0 0 1-1.445-.83c-.27-.608-.352-1.395-.329-2.21.024-.826.16-1.73.365-2.606.206-.875.486-1.733.805-2.466.315-.722.687-1.364 1.094-1.772a2.34 2.34 0 0 1 .433-.335.504.504 0 0 1-.028-.079zm2.036.412c-.877.185-1.469.443-1.733.708-.276.276-.587.783-.885 1.465a13.748 13.748 0 0 0-.748 2.295 12.351 12.351 0 0 0-.339 2.406c-.022.755.062 1.368.243 1.776a.42.42 0 0 0 .426.24c.327-.034.61-.199.929-.502.212-.202.4-.423.615-.674.133-.156.276-.323.44-.504C4.861 9.969 5.978 9.027 8 9.027s3.139.942 3.965 1.855c.164.181.307.348.44.504.214.251.403.472.615.674.318.303.601.468.929.503a.42.42 0 0 0 .426-.241c.18-.408.265-1.02.243-1.776a12.354 12.354 0 0 0-.339-2.406 13.753 13.753 0 0 0-.748-2.295c-.298-.682-.61-1.19-.885-1.465-.264-.265-.856-.523-1.733-.708-.85-.179-1.877-.27-2.913-.27-1.036 0-2.063.091-2.913.27z"/>
                </svg>
            </div>
            <div class="fl" style="height: 60px;line-height: 50px;font-size: 24px;margin-right: 10px;">官方渠道</div>
            <div class="author-way fl">
                <svg xmlns="http://www.w3.org/2000/svg" width="40" height="40" fill="currentColor" class="bi bi-wechat" viewBox="0 0 16 16">
                    <path d="M11.176 14.429c-2.665 0-4.826-1.8-4.826-4.018 0-2.22 2.159-4.02 4.824-4.02S16 8.191 16 10.411c0 1.21-.65 2.301-1.666 3.036a.324.324 0 0 0-.12.366l.218.81a.616.616 0 0 1 .029.117.166.166 0 0 1-.162.162.177.177 0 0 1-.092-.03l-1.057-.61a.519.519 0 0 0-.256-.074.509.509 0 0 0-.142.021 5.668 5.668 0 0 1-1.576.22ZM9.064 9.542a.647.647 0 1 0 .557-1 .645.645 0 0 0-.646.647.615.615 0 0 0 .09.353Zm3.232.001a.646.646 0 1 0 .546-1 .645.645 0 0 0-.644.644.627.627 0 0 0 .098.356Z"/>
                    <path d="M0 6.826c0 1.455.781 2.765 2.001 3.656a.385.385 0 0 1 .143.439l-.161.6-.1.373a.499.499 0 0 0-.032.14.192.192 0 0 0 .193.193c.039 0 .077-.01.111-.029l1.268-.733a.622.622 0 0 1 .308-.088c.058 0 .116.009.171.025a6.83 6.83 0 0 0 1.625.26 4.45 4.45 0 0 1-.177-1.251c0-2.936 2.785-5.02 5.824-5.02.05 0 .1 0 .15.002C10.587 3.429 8.392 2 5.796 2 2.596 2 0 4.16 0 6.826Zm4.632-1.555a.77.77 0 1 1-1.54 0 .77.77 0 0 1 1.54 0Zm3.875 0a.77.77 0 1 1-1.54 0 .77.77 0 0 1 1.54 0Z"/>
                </svg>
                <svg t="1662107665726" class="icon" viewBox="0 0 1024 1024" version="1.1"
                     xmlns="http://www.w3.org/2000/svg" p-id="8215" width="40" height="40">
                    <path d="M537.402426 0c339.828004 0 356.762955 330.231533 356.762955 330.231533
                      51.36935 69.433297 23.708931 131.528115 23.708931 131.528115 165.962514
                      264.749724 58.707828 341.521499 29.353914 347.166483-29.353914
                      5.644983-57.014333-32.740904-57.014333-32.740904s-9.596472 38.385888-33.305402
                      58.14333c86.368247 41.208379 71.126792 92.01323 71.126792 92.01323s-18.063947
                      154.108049-377.649394 56.449835l-30.482911-5.644983c-344.343991
                      126.44763-387.245865-44.030871-387.245865-44.030871s-14.112459-70.562293
                      53.062845-97.658214c-38.950386-24.273429-53.062845-75.07828-53.062845-75.07828S97.093716
                      818.522602 50.804851 797.636163c-45.724366-21.450937-73.949283-209.428886
                      98.787211-345.472988 0 0-24.837927-80.723264 32.176406-128.705623C181.768467
                      322.893054 197.009923 0 537.402426 0L537.402426 0z" p-id="8216" fill="#bfbfbf">
                    </path>
                </svg>
            </div>
            <div class="friend-web fr">
                <p><a href="https://store.steampowered.com/">Steam</a></p>
                <p><a href="https://www.wegame.com.cn/">WeGame</a></p>
                <p><a href="https://store.playstation.com/zh-hans-cn/pages/latest">PlayStation</a></p>
                <p><a href="https://store.epicgames.com/zh-CN/">EPIC</a></p>
            </div>
            <div class="fr" style="height: 60px;line-height: 50px;font-size: 24px;margin-right: 30px">友情链接</div>
        </div>
        <div class="footer-text clearbox">
            <div>关于我们 | About Us | 服务条款 | 用户服务协议 | 隐私政策 | 侵权通知 | 广告服务 | 成员招聘 | 客服中心 | 网站导航</div>
            <div>COPYRIGHT © 2022.06 – 2022.09 EXGAME. ALL RIGHTS RESERVED.</div>
            <div style="margin-top: 15px">臻Game项目组版权所有</div>
        </div>
    </div>
</template>

<script>
export default {
    name: "GamePageFooter"
}
</script>

<style scoped>
*{
    margin: 0;
    padding: 0;
    box-sizing: border-box;
}
ul, ol{
    list-style: none;
}
.fl{
    float: left;
}
.fr{
    float: right;
}
.clearbox{
    clear:both;
}
.footer-pic{
    width: 900px;
    height: 80px;
    margin: 10px auto;
}
.footer-text{
    font-size: 12px;
    line-height: 20px;
}
.exgame-page-footer {
    position: page;
    text-align: center;
    bottom: 0;
    color: #cccccc;
    width: 100%;
    height: 180px;/*脚部的高度*/
    background-color: #212121;
    clear:both;
    overflow: hidden;
    margin-top: 200px;
}
.game-pi{
    margin-right: 100px;
}
.game-pi svg{
    margin-top: 10px;
    float: left;
}
.author-way{
    margin-top: 20px;
    margin-right:20px;

}
.author-way svg{
    margin-left: 20px;
}
.friend-web{
    margin-top: 10px;
    font-size: 14px;
    width: 210px;
}
.friend-web a{
    text-decoration: none;
    color: #cccccc;
    width: 100px;
    float: left;
    text-align: left;
    line-height: 30px;
}
.friend-web a:hover{
   color: white;
}
</style>
